<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

class SettingsTableSeeder extends Seeder
{

    /**
     * Auto generated seed file
     *
     * @return void
     */
    public function run()
    {
        \DB::table('settings')->delete();

        \DB::table('settings')->insert([
            0 =>
                [
                    'id' => 1,
                    'key' => 'website_about',
                    'value' => '<p dir="rtl">لیلام مرجع نیازمندی‌های آنلاین&nbsp; و رایگان کشور است که ازسال 1398&nbsp; بدین سو فعالیت دارد.&nbsp; در اپلیکیشن لیلام می‌توانید به صورت امن و آسان انواع خدمات و کالای نو و دست دوم را خرید و فروش کنید.</p><p dir="rtl">کاربرانی که قصد استفاده از خدمات اپلیکشن لیلام را دارند، لازم است این ضوابط و شرایط را به طور کامل مطالعه و سپس اقدام به عضویت و ثبت اعلانات دراپلیکشن لیلام به منزله علم و آگاهی کلیه کاربران نسبت به ضوابط و شرایط خدمات مورد درخواست می باشد. لازم به ذکر است که کاربران با ثبت اعلانات ، ثبت درخواست خدمات ودر واقع اعلام می نمایند که کلیه ضوابط و مقررات را مطالعه نموده و ملتزم به آن می باشند با درج آگهی و ثبت درخواست خدمات در اپلیکشن در واقع قراردادی بین کاربران منعقد می گردد که طرفین طبق ضوابط و مفاد ذیل متعهد به آن می باشند.</p><p dir="rtl">با دانلود و نصب برنامه&nbsp; لیلام نیازمندی‌های آنلاین سراسر افغانستان، با امکان ثبت هر نوع اعلان فراهم میشود.&nbsp;</p><p dir="rtl">اپ لیلام به صورت رایگان برای هر دو سیستم عامل اندروید (Android) و آی‌او‌اس (iOS) عرضه شده است تا به مشترکین امکان خرید و فروش بی واسطه را فراهم نماید.&nbsp;</p><p dir="rtl"><strong>دسته بندی لیلام:</strong></p><p dir="rtl">• <strong>وسایل نقلیه:</strong> ماشین، موترسکلیت و دو چرخه، قطعات ماشین.</p><p dir="rtl"><strong>• املاک و جایداد‌:</strong> خرید و فروش آپارتمان، خانه و زمین. کرایه آپارتمان، خانه و زمین. خرید و فروش دوکان، تجاری و اداری. کرایه دوکان، تجاری و اداری و لوازم دوکان و کارخانه.</p><p dir="rtl"><strong>• استخدام و کاریابی:</strong> لیلام زمینه استخدام و کار یابی را برای هر نوع شغل و هر صنفی فراهم میکند که با استفاده از لیلام به راحتی امکان استخدام افراد مورد نظر فراهم میشود.&nbsp;</p><p dir="rtl"><strong>• لوازم خانگی:</strong> مبلمان و لوازم چوبی. الماری و تخت‌خواب. وسایل آشپزخانه. وسایل برقی خانه. فرش، گلیم و قالیچه و وسایل تزئینی خانه.</p><p dir="rtl"><strong>• وسایل شخصی:</strong> کیف، کفش و لباس، جواهرات و ساعت، آرایشی و لوازم بهداشتی، وسایل موسیقی و وسایل اسباب بازی.</p><p dir="rtl"><strong>• لوازم الکترونیکی:</strong> کامپیوتر و لپتاب، موبایل و تبلت. کنسول، گیم و لوازم صوتی و تصویری، کامره&nbsp; و لوازم کامپیوتر و مبایل.</p><p dir="rtl"><strong>برخی ویژگی های اپلیکیشن لیلام: &nbsp;</strong></p><p dir="rtl">• فیلتر پیشرفته جهت دستیابی سریع به اعلانات و جستجوی اعلانات و جنس بر اساس استان، شهر و حتی روستا.</p><p dir="rtl">• مشاهده همه اعلان های سراسر افغانستان بصورت یکجا.</p><p dir="rtl">• امکان ثبت و جستجو اعلانات در تمامی استان ها و شهرستان ‌های افغانستان.</p><p dir="rtl">• امکان چت با اعلان دهنده با امکان ارسال تصویر.</p><p dir="rtl">• به ‌روز رسانی (آپدیت) اعلان و قرار دادن در لیست علاقه‌مندی‌ها.</p><p dir="rtl">• تایید فوری اعلانات (درکمتر از 5 دقیقه)</p><p dir="rtl">• پشتیبانی ۲۴ ساعته در ۷ روز هفته.</p><p dir="rtl"><strong>روش استفاده و نحونصب :</strong></p><p dir="rtl">مشترکین لیلام میتواند محصولی که قصد فروش آن را دارد، ابتدا از آن عکس گرفته و سپس یکی از دسته‌بندی های موجود در لیست را انتخاب نماید ودر قسمت توضیحات، برای محصول(جنس یا خدمات) خود توضیحات لازم را در فورم مورد نظر پر نماید و در نهایت دکمه تایید اعلان را بزند.</p><p dir="rtl">1. جستجو کردن درApp store &nbsp; وgoogle play</p><p dir="rtl">2. نصب از لینک " هوشمند"</p><p dir="rtl">مشترکین با نصب اپلیکشن می تواند اعلانات کالاها را به شکل آنلاین و رایگان به نشر برسانند، با وارد کردن شماره و مشخصات شان ارتباط مستقیم با مشترکین دیگر برقرار کنند.</p><p dir="rtl">با وارد نکردن شماره ومشخصات تان شما نمی توانید "اعلانات من" که مربوط اعلانات خودتان میشود( لیست تمام اعلانات، حذف و ویرایش، عکس پروفایل و نام) وارد شوید.&nbsp;</p>',
                    'created_at' => '2022-08-15 14:03:01',
                    'updated_at' => '2022-08-15 14:19:55',
                ],
            1 =>
                [
                    'id' => 2,
                    'key' => 'default_phone_number',
                    'value' => '<p>0747857970</p>',
                    'created_at' => '2022-08-15 14:24:54',
                    'updated_at' => '2022-08-15 14:24:54',
                ],
            2 =>
                [
                    'id' => 3,
                    'key' => 'default_email',
                    'value' => '<p>lilamapp@gmail.com</p>',
                    'created_at' => '2022-08-15 14:25:42',
                    'updated_at' => '2022-08-15 14:25:42',
                ],
            3 =>
                [
                    'id' => 4,
                    'key' => 'website_privacy_text',
                    'value' => '<p dir="rtl">اپلیکشن لیلام با ثبت اعلانات تکراری، مشابه و یا درج چند اعلانات با یک تصویر، استفاده ازاعلانات مشترکین دیگر، و نامناسب و رنگی به نحوی که تصویر اعلانات را غیرقابل مشاهده نماید، تایید نمیشود ورد میکند.</p><p dir="rtl">ثبت تصویر نامنظم&nbsp; با کالا و یا خدمات اعلانات شده، ثبت اعلانات با خدمات نامشخص، ثبت اعلانات کالا با مشخصات و توضیحات نامنظم، ارایه اطلاعات نادرست و قیمت غیر واقعی، مفت، ارزان و... به نحوی که مشتری را گمراه نماید. تایید ونشرنمشوید.</p><p dir="rtl">·&nbsp; &nbsp; &nbsp; &nbsp; ثبت اعلانات اعضای بدن.&nbsp;</p><p dir="rtl">·&nbsp; &nbsp; &nbsp; &nbsp; ثبت اعلانات مربوط به کالاهای قاچاق و غیرقانونی</p><p dir="rtl">·&nbsp; &nbsp; &nbsp; &nbsp; ثبت اعلانات کالاهایی که طبق قوانین کشور افغانستان معامله آنها ممنوع است</p><p dir="rtl"><strong>·</strong>&nbsp; &nbsp; &nbsp; &nbsp; ثبت اعلانات اموال مسروقه یا کالاهایی که از ارتکاب جرم بدست آورده شده هست.&nbsp;</p><p dir="rtl"><strong>·</strong>&nbsp; &nbsp; &nbsp; &nbsp; ثبت اعلانات کالاهای مرتبط با قمار، بخت آزمایی و شرط بندی.&nbsp;</p><p dir="rtl"><strong>·</strong>&nbsp; &nbsp; &nbsp; &nbsp; ثبت اعلانات کالاهایی که در توضیح آنها از مفاهیم انتزاعی در حوزه دین و اعتقادات مردمی استفاده شده است مانند دعا، طلسم، سحر، جادو و جنبل، بخت، شانس، اقبال و....&nbsp;</p><p dir="rtl">اپلیکشن لیلام هیچ مسئولیت درقبال&nbsp; داد وگرفت و رد وقبول کالاهای کابران چه حضوری یا غیرحضوری به عهده ندارد.&nbsp;</p>',
                    'created_at' => '2022-08-15 14:41:38',
                    'updated_at' => '2022-08-15 14:41:38',
                ],
            4 =>
                [
                    'id' => 5,
                    'key' => 'website_terms_text',
                    'value' => '<p dir="rtl"><strong>شرایط تعهد کابرفروشنده</strong>:&nbsp;</p><p dir="rtl">·&nbsp; &nbsp; &nbsp; &nbsp; توضیحات و سایر اطلاعات اعلانات باید کامل و دقیق مطابق با کالایی باشد که مشترکین فروشنده قصد فروش آن را دارد.</p><p dir="rtl">·&nbsp; &nbsp; &nbsp; &nbsp; تصاویر اعلانات باید واقعی بوده و از خود کالا عکس گرفته شده باشد.</p><p dir="rtl">·&nbsp; &nbsp; &nbsp; &nbsp; مشترکین فروشنده تنها مجاز به ثبت اعلانات کالاهای موجودی می باشد که مالک آن است&nbsp;</p><p dir="rtl">·&nbsp; &nbsp; &nbsp; &nbsp; در صورت ثبت اعلان کالا باید رنگ ها و موجودی آنها در متن اعلان به صورت کامل ثبت&nbsp; شود. همچنین باید تصاویر کلیه رنگ ها نیز در اعلانات قرار گیرد تا خریدار بتواند دقیق تر نسبت به خرید اقدام نماید.</p><p dir="rtl"><strong>شرایط وتعهدات خریدار:</strong></p><p dir="rtl">·&nbsp; &nbsp; &nbsp; &nbsp; مشترکین خریدار، کالا را از مشترکین فروشنده بر اساس اعتماد و اعتبار فروشنده خریداری می نماید و خریدار با علم و آگاهی از اینکه لیلام هیچگونه مسئولیتی در خصوص کیفیت و کمیت کالا یا عدم تطابق کالا با نمونه درخواست شده، ندارد، کالا را خریداری و دریافت می نماید.</p><p dir="rtl"><strong>·</strong>&nbsp; &nbsp; &nbsp; &nbsp;خریدار برای پرداخت ارزش کالا باید اطمینان حاصل نماید.</p><p dir="rtl"><strong>·</strong>&nbsp; &nbsp; &nbsp; &nbsp;چنانچه مشترکین فروشنده هزینه ارسال کالا را برعهده خریدار و درقصد انتخاب او نموده باشد، مشترکین خریدار موظف به پرداخت هزینه می باشد یا خیر. اپلیکشن لیلام هیچ مسئولیتی به عهده ندارد.</p>',
                    'created_at' => '2022-08-15 14:47:23',
                    'updated_at' => '2022-08-15 14:47:23',
                ],
            5 =>
                [
                    'id' => 6,
                    'key' => 'website_youtube_link',
                    'value' => '<p>https://www.youtube.com/channel/UCpQI2HAa3P_WBBEWR3JqnjQ</p>',
                    'created_at' => '2022-08-15 14:54:02',
                    'updated_at' => '2022-08-15 14:54:02',
                ],
            6 =>
                [
                    'id' => 7,
                    'key' => 'website_instagram_link',
                    'value' => '<p>https://zil.ink/namarasana</p>',
                    'created_at' => '2022-08-15 14:54:24',
                    'updated_at' => '2022-08-15 14:54:24',
                ],
            7 =>
                [
                    'id' => 8,
                    'key' => 'website_facebook_link',
                    'value' => '<p>https://m.facebook.com/namarasana1</p>',
                    'created_at' => '2022-08-15 14:54:40',
                    'updated_at' => '2022-08-15 14:54:40',
                ],
            8 =>
                [
                    'id' => 9,
                    'key' => 'website_tiktok_link',
                    'value' => '<p>https://vt.tiktok.com/ZSd9B34XY/</p>',
                    'created_at' => '2022-08-15 14:54:55',
                    'updated_at' => '2022-08-15 14:54:55',
                ],
        ]);

    }
}
