<?php

return [
	"login" => [
		"username_or_email" => "یوزرنیم یا ایمیل",
		"forgot_password_link" => "رمز عبور را فراموش کرده اید؟",
		"create_an_account" => "ساخت حساب کاربری",
	],
	"two_factor" => [
		"heading" => "چالش امنیتی دو مرحله ای",
		"description" => "Please confirm access to your account by entering the authentication code provided by your authenticator application.",
		"description" => "لطفا برای دسترسی به حساب شما تایید کنید با وارد کردن کد تاییدیه اینترنتی که به شما ارسال شده است.",
		"code_placeholder" => "XXX-XXX",
		"recovery" => [
			"heading" => "چالش امنیتی دو مرحله ای",
			"description" => "لطفا برای دسترسی به حساب شما کد بازیابی تایید کنید با وارد کردن کد تاییدیه اینترنتی که به شما ارسال شده است.",
		],
		"recovery_code_placeholder" => "abcdef-98765",
		"recovery_code_text" => "دستگاه شما گم شده است؟",
		"recovery_code_link" => "استفاده از کد بازیابی",
		"back_to_login_link" => "بازگشت به صفحه ورود",
	],
	"registration" => [
		"title" => "ثبت نام",
		"heading" => "ساخت حساب کاربری جدید",
		"submit" => [
			"label" => "ثبت نام",
		],
		"notification_unique" => "یک حساب کاربری با ایمیلی که وارد کرده اید، وجود دارد. لطفا وارد شوید",
	],
	"reset_password" => [
		"title" => "رمز عبور را فراموش کرده اید؟",
		"heading" => "رمز عبور را دوباره بنویسید",
		"submit" => [
			"label" => "ثبت",
		],
		"notification_error" => "خطا: لطفا دوباره امتحان کنید.",
		"notification_success" => "ایمیل تان را برای مراحل بعدی بررسی کنید.",
	],
	"verification" => [
		"title" => "تایید ایمیل",
		"heading" => "تایید ایمیل نیاز است",
		"submit" => [
			"label" => "خارج شدن از حساب کاربری",
		],
		"notification_success" => "ایمیل تان را برای مراحل بعدی بررسی کنید.",
		"notification_resend" => "ایمیل تایید دوباره ارسال شد",
		"before_proceeding" => "قبل از ادامه، لطفا ایمیل خود را برای تاببدی بررسی کنید.",
		"not_receive" => "اگر ایمیل دریافت نکرده اید،",
		"request_another" => "برای درخواست ایمیل جدید، کلیک کنید",
	],
	"profile" => [
		"account" => "حساب کاربری",
		"profile" => "نمایه کاربری",
		"my_profile" => "نمایه کاربری من",
		"personal_info" => [
			"heading" => "معلومات شخصی",
			"subheading" => "مدیریت معلومات شخصی",
			"submit" => [
				"label" => "ویرایش",
			],
			"notify" => "نمایه کاربری ویرایش شد!",
		],
		"password" => [
			"heading" => "رمز عبور",
			"subheading" => "باید حداقل 8 کاراکتر باشد",
			"submit" => [
				"label" => "ویرایش",
			],
			"notify" => "رمزعبور با موفقیت ویرایش شد.",
		],
		"2fa" => [
			"title" => "تایید رمز عبور دو مرحله ای",
			"description" => "مدیریت تایید رمز عبور دو مرحله ای (پیشنهادی)",
			"actions" => [
				"enable" => "فعال سازی",
				"regenerate_codes" => "دوبار تولید کردن رمز ها",
				"disable" => "غیرفعال سازی",
				"confirm_finish" => "تایید و خروج",
				"cancel_setup" => "لغو کردن",
			],
			"setup_key" => "تنظیم کلید",
			"not_enabled" => [
				"title" => "شما تایید رمز عبور دو مرحله ای را فعال ننموده اید!",
				"description" => "زمانیکه تایید رمزعبور دو مرحله ای فعال باشد، شما باید یک توکن تصادفی و امن را در مرحله ورود وارد کنید، همچنان میتوانید از برنامه Google Authenticator استفاده کنید!",
			],
			"finish_enabling" => [
				"title" => "پایان",
				"description" => "برای پایان فعال سازی تایید رمز دو مرحله ای، کیو آر کد زیر را توسط یک برنامه Authenticator در موبایل تان اسکن یا کلیدی یکبار مصرف که سیستم در مرحله های قبل داده بود را وارد کنید!",
			],
			"enabled" => [
				"title" => "شما تایید رمز عبور دو مرحله ای را فعال نموده اید!",
				"description" => "برای پایان فعال سازی تایید رمز دو مرحله ای، کیو آر کد زیر را توسط یک برنامه Authenticator در موبایل تان اسکن یا کلیدی یکبار مصرف که سیستم در مرحله های قبل داده بود را وارد کنید!",
				"store_codes" => "این کلید های بازیابی را در یک برنامه مدیریت پسورد امن نگهداری نمایید، چون برای بازیابی حساب تان استفاده میشوند.",
				"show_codes" => 'نمایش کلید های بازیابی',
				"hide_codes" => 'عدم نمایش کلید های بازیابی',
			],
			"confirmation" => [
				"success_notification" => 'کلید وارد شده تایید شد. تایید کد دو مرحله ای با موفقیت فعال شد.',
				"invalid_code" => "کد وارد شده شما اشتباه است",
			],
		],
		"sanctum" => [
			"title" => "کلید های API",
			"description" => "مدیریت کلید های API. این کلید ها برای اجازه دسترسی سرویس ها و برنامه های شخص ثالث استفاده میشوند. توکن ها فقط برای بار اول نمایش داده میشوند و در صورت گم شدن میتوانید آنرا حذف و یک توکن جدید ایجاد کنید!",
			"create" => [
				"notify" => "توکن با موفقیت ایجاد شد!",
				"submit" => [
					"label" => "تولید",
				],
			],
			"update" => [
				"notify" => "توکن با موفقیت ویرایش شد.",
			],
		],
	],
	"fields" => [
		"email" => "ایمیل",
		"login" => "ورود به سیستم",
		"name" => "نام",
		"password" => "رمز عبور",
		"password_confirm" => "تایید رمز عبور",
		"new_password" => "رمز عبور جدید",
		"new_password_confirmation" => "تایید رمز عبور جدید",
		"token_name" => "نام توکن",
		"abilities" => "قابلیت ها",
		"2fa_code" => "کد",
		"2fa_recovery_code" => "کد بازیابی",
	],
	"or" => "یا",
	"cancel" => "لغو",
];
